performance/axis2/data/receiveSimpleEvents-50.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:receiveSimpleEvents xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:input><ns1:sequenceNumber>0</ns1:sequenceNumber><ns1:timestamp>0.0</ns1:timestamp><ns1:message>Message #0</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>1</ns1:sequenceNumber><ns1:timestamp>1.0</ns1:timestamp><ns1:message>Message #1</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>2</ns1:sequenceNumber><ns1:timestamp>1.4142135623730951</ns1:timestamp><ns1:message>Message #2</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>3</ns1:sequenceNumber><ns1:timestamp>1.7320508075688772</ns1:timestamp><ns1:message>Message #3</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>4</ns1:sequenceNumber><ns1:timestamp>2.0</ns1:timestamp><ns1:message>Message #4</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>5</ns1:sequenceNumber><ns1:timestamp>2.23606797749979</ns1:timestamp><ns1:message>Message #5</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>6</ns1:sequenceNumber><ns1:timestamp>2.449489742783178</ns1:timestamp><ns1:message>Message #6</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>7</ns1:sequenceNumber><ns1:timestamp>2.6457513110645907</ns1:timestamp><ns1:message>Message #7</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>8</ns1:sequenceNumber><ns1:timestamp>2.8284271247461903</ns1:timestamp><ns1:message>Message #8</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>9</ns1:sequenceNumber><ns1:timestamp>3.0</ns1:timestamp><ns1:message>Message #9</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>10</ns1:sequenceNumber><ns1:timestamp>3.1622776601683795</ns1:timestamp><ns1:message>Message #10</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>11</ns1:sequenceNumber><ns1:timestamp>3.3166247903554</ns1:timestamp><ns1:message>Message #11</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>12</ns1:sequenceNumber><ns1:timestamp>3.4641016151377544</ns1:timestamp><ns1:message>Message #12</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>13</ns1:sequenceNumber><ns1:timestamp>3.605551275463989</ns1:timestamp><ns1:message>Message #13</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>14</ns1:sequenceNumber><ns1:timestamp>3.7416573867739413</ns1:timestamp><ns1:message>Message #14</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>15</ns1:sequenceNumber><ns1:timestamp>3.872983346207417</ns1:timestamp><ns1:message>Message #15</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>16</ns1:sequenceNumber><ns1:timestamp>4.0</ns1:timestamp><ns1:message>Message #16</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>17</ns1:sequenceNumber><ns1:timestamp>4.123105625617661</ns1:timestamp><ns1:message>Message #17</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>18</ns1:sequenceNumber><ns1:timestamp>4.242640687119285</ns1:timestamp><ns1:message>Message #18</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>19</ns1:sequenceNumber><ns1:timestamp>4.358898943540674</ns1:timestamp><ns1:message>Message #19</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>20</ns1:sequenceNumber><ns1:timestamp>4.47213595499958</ns1:timestamp><ns1:message>Message #20</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>21</ns1:sequenceNumber><ns1:timestamp>4.58257569495584</ns1:timestamp><ns1:message>Message #21</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>22</ns1:sequenceNumber><ns1:timestamp>4.69041575982343</ns1:timestamp><ns1:message>Message #22</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>23</ns1:sequenceNumber><ns1:timestamp>4.795831523312719</ns1:timestamp><ns1:message>Message #23</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>24</ns1:sequenceNumber><ns1:timestamp>4.898979485566356</ns1:timestamp><ns1:message>Message #24</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>25</ns1:sequenceNumber><ns1:timestamp>5.0</ns1:timestamp><ns1:message>Message #25</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>26</ns1:sequenceNumber><ns1:timestamp>5.0990195135927845</ns1:timestamp><ns1:message>Message #26</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>27</ns1:sequenceNumber><ns1:timestamp>5.196152422706632</ns1:timestamp><ns1:message>Message #27</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>28</ns1:sequenceNumber><ns1:timestamp>5.291502622129181</ns1:timestamp><ns1:message>Message #28</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>29</ns1:sequenceNumber><ns1:timestamp>5.385164807134504</ns1:timestamp><ns1:message>Message #29</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>30</ns1:sequenceNumber><ns1:timestamp>5.477225575051661</ns1:timestamp><ns1:message>Message #30</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>31</ns1:sequenceNumber><ns1:timestamp>5.5677643628300215</ns1:timestamp><ns1:message>Message #31</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>32</ns1:sequenceNumber><ns1:timestamp>5.656854249492381</ns1:timestamp><ns1:message>Message #32</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>33</ns1:sequenceNumber><ns1:timestamp>5.744562646538029</ns1:timestamp><ns1:message>Message #33</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>34</ns1:sequenceNumber><ns1:timestamp>5.830951894845301</ns1:timestamp><ns1:message>Message #34</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>35</ns1:sequenceNumber><ns1:timestamp>5.916079783099616</ns1:timestamp><ns1:message>Message #35</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>36</ns1:sequenceNumber><ns1:timestamp>6.0</ns1:timestamp><ns1:message>Message #36</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>37</ns1:sequenceNumber><ns1:timestamp>6.082762530298219</ns1:timestamp><ns1:message>Message #37</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>38</ns1:sequenceNumber><ns1:timestamp>6.164414002968976</ns1:timestamp><ns1:message>Message #38</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>39</ns1:sequenceNumber><ns1:timestamp>6.244997998398398</ns1:timestamp><ns1:message>Message #39</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>40</ns1:sequenceNumber><ns1:timestamp>6.324555320336759</ns1:timestamp><ns1:message>Message #40</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>41</ns1:sequenceNumber><ns1:timestamp>6.4031242374328485</ns1:timestamp><ns1:message>Message #41</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>42</ns1:sequenceNumber><ns1:timestamp>6.48074069840786</ns1:timestamp><ns1:message>Message #42</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>43</ns1:sequenceNumber><ns1:timestamp>6.557438524302</ns1:timestamp><ns1:message>Message #43</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>44</ns1:sequenceNumber><ns1:timestamp>6.6332495807108</ns1:timestamp><ns1:message>Message #44</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>45</ns1:sequenceNumber><ns1:timestamp>6.708203932499369</ns1:timestamp><ns1:message>Message #45</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>46</ns1:sequenceNumber><ns1:timestamp>6.782329983125268</ns1:timestamp><ns1:message>Message #46</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>47</ns1:sequenceNumber><ns1:timestamp>6.855654600401044</ns1:timestamp><ns1:message>Message #47</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>48</ns1:sequenceNumber><ns1:timestamp>6.928203230275509</ns1:timestamp><ns1:message>Message #48</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>49</ns1:sequenceNumber><ns1:timestamp>7.0</ns1:timestamp><ns1:message>Message #49</ns1:message></ns1:input></ns1:receiveSimpleEvents></soapenv:Body></soapenv:Envelope>